2195573507-web/Smart_Car/STM32H757/CM7/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "bsp_uart.h"
#include "boot_log.h"
#include "imu_runtime.h"
#include "uart_link.h"
#include "s3_service.h"
#include "log_service.h"
#include "rtos_health.h"
#include "stm32h7xx_it.h"
#include "motor_board_protocol.h"
#include "motor_board_task.h"
#include "motor_board_transport_uart.h"
#include "attitude_startup_coordinator.h"
#include "chassis_task.h"
#include "cm7_raw_diag.h"

#include <stdio.h>
#include <string.h>

#include "FreeRTOS.h"
#include "task.h"

#ifndef SMARTCAR_MOTOR_BOARD_ONLY
#define SMARTCAR_MOTOR_BOARD_ONLY 0
#endif

#ifndef SMARTCAR_SCHEDULER_PROBE
#define SMARTCAR_SCHEDULER_PROBE 0
#endif

#ifndef SMARTCAR_RAW_DIAGNOSTICS
#define SMARTCAR_RAW_DIAGNOSTICS 0
#endif

#define SMARTCAR_SCHEDULER_PROBE_STACK_WORDS UINT16_C(512)
#define SMARTCAR_SCHEDULER_PROBE_PERIOD_MS UINT32_C(50)
#define SMARTCAR_SCHEDULER_PROBE_LOG_PERIOD_MS UINT32_C(1000)
#define SMARTCAR_SCHEDULER_PROBE_TEXT "SCHEDULER_PROBE"
#define SMARTCAR_SCHEDULER_PROBE_TEXT_LENGTH \
  ((uint16_t)(sizeof(SMARTCAR_SCHEDULER_PROBE_TEXT) - 1U))
#define SMARTCAR_SCHEDULER_PROBE_PAYLOAD_LENGTH \
  ((uint16_t)(LOG_SERVICE_PAYLOAD_HEADER_SIZE + \
              SMARTCAR_SCHEDULER_PROBE_TEXT_LENGTH))

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* This image is CM7-only; do not wait for or release a CM4 image. */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c4;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

/* USER CODE BEGIN PV */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
#if !SMARTCAR_MOTOR_BOARD_ONLY
static void MX_I2C4_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
#endif
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static void report_retained_fault(void)
{
  const volatile fault_record_t *record;
  char line[64];

  if (!fault_record_is_valid()) {
    return;
  }
  record = fault_record_get();
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_marker("[ERROR] RETAINED_FAULT");
  cm7_raw_diag_value("FAULT_EXCEPTION", record->exception);
  cm7_raw_diag_value("FAULT_PC", record->pc);
  cm7_raw_diag_value("FAULT_CFSR", record->cfsr);
#endif
  LOG_ERROR("FAULT DETECTED");
  (void)snprintf(line, sizeof(line), "PC=0x%08lX",
                 (unsigned long)record->pc);
  LOG_ERROR(line);
  (void)snprintf(line, sizeof(line), "LR=0x%08lX",
                 (unsigned long)record->lr);
  LOG_ERROR(line);
  (void)snprintf(line, sizeof(line), "CFSR=0x%08lX",
                 (unsigned long)record->cfsr);
  LOG_ERROR(line);
  (void)snprintf(line, sizeof(line), "HFSR=0x%08lX",
                 (unsigned long)record->hfsr);
  LOG_ERROR(line);
  fault_record_clear();
}

static void report_retained_rtos_health(void)
{
  rtos_health_snapshot_t snapshot;
  char line[SMARTCAR_LOG_MAX_PAYLOAD + 1U];

  if (!rtos_health_has_fatal_event() ||
      !rtos_health_get_snapshot(&snapshot)) {
    return;
  }
  (void)snprintf(line, sizeof(line),
                 "[FAULT_PREVIOUS_BOOT] RTOS FAULT event=%u task=%s stack_overflow=%lu "
                 "malloc_failed=%lu",
                 (unsigned)snapshot.last_event,
                 snapshot.last_task_name,
                 (unsigned long)snapshot.stack_overflow_count,
                 (unsigned long)snapshot.malloc_failed_count);
  LOG_ERROR(line);
  rtos_health_clear();
}

static uint8_t scheduler_task_present(const char *name)
{
  return (name != NULL && xTaskGetHandle(name) != NULL) ? 1U : 0U;
}

/* This snapshot is deliberately emitted before the scheduler starts. It
 * distinguishes a pre-start task-admission/heap failure from a task that was
 * admitted but never scheduled. */
static void scheduler_log_task_admission(void)
{
  char line[SMARTCAR_LOG_MAX_PAYLOAD + 1U];

  (void)snprintf(line, sizeof(line),
                 "RTOS_ADMISSION sched=%ld heap=%lu min=%lu "
                 "log=%u uart=%u s3=%u imu=%u imulog=%u gate=%u",
                 (long)xTaskGetSchedulerState(),
                 (unsigned long)xPortGetFreeHeapSize(),
                 (unsigned long)xPortGetMinimumEverFreeHeapSize(),
                 (unsigned)scheduler_task_present("logger"),
                 (unsigned)scheduler_task_present("srp_uart"),
                 (unsigned)scheduler_task_present("s3_service"),
                 (unsigned)scheduler_task_present("imu_task"),
                 (unsigned)scheduler_task_present("imu_data_logger"),
                 (unsigned)scheduler_task_present("attitude_gate"));
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_marker("RTOS_ADMISSION");
  cm7_raw_diag_value("ADMISSION_HEAP", (uint32_t)xPortGetFreeHeapSize());
  cm7_raw_diag_value("ADMISSION_MIN_HEAP",
                     (uint32_t)xPortGetMinimumEverFreeHeapSize());
  cm7_raw_diag_value("ADMISSION_SCHEDULER", (uint32_t)xTaskGetSchedulerState());
#endif
  LOG_INFO(line);
}

#if SMARTCAR_SCHEDULER_PROBE
static TaskHandle_t s_scheduler_probe_task;
static uint8_t s_scheduler_probe_payload[SMARTCAR_SCHEDULER_PROBE_PAYLOAD_LENGTH];
static uint32_t s_scheduler_probe_send_count;
static uint32_t s_scheduler_probe_send_failures;

static HAL_StatusTypeDef scheduler_probe_send_once(void)
{
  const uint32_t timestamp = HAL_GetTick();
  int result;

  s_scheduler_probe_payload[0] = 0U; /* STM32 source */
  s_scheduler_probe_payload[1] = SMARTCAR_LOG_LEVEL_INFO;
  s_scheduler_probe_payload[2] = (uint8_t)(timestamp & 0xFFU);
  s_scheduler_probe_payload[3] = (uint8_t)((timestamp >> 8U) & 0xFFU);
  s_scheduler_probe_payload[4] = (uint8_t)((timestamp >> 16U) & 0xFFU);
  s_scheduler_probe_payload[5] = (uint8_t)((timestamp >> 24U) & 0xFFU);
  s_scheduler_probe_payload[6] =
      (uint8_t)(SMARTCAR_SCHEDULER_PROBE_TEXT_LENGTH & 0xFFU);
  s_scheduler_probe_payload[7] =
      (uint8_t)(SMARTCAR_SCHEDULER_PROBE_TEXT_LENGTH >> 8U);
  (void)memcpy(&s_scheduler_probe_payload[LOG_SERVICE_PAYLOAD_HEADER_SIZE],
               SMARTCAR_SCHEDULER_PROBE_TEXT,
               SMARTCAR_SCHEDULER_PROBE_TEXT_LENGTH);

  /* Preserve the quiet pre-sync USART2 policy.  Before CMD_SYNC_REQ, the
   * probe uses the independent USART1 raw marker and is not a failed SRP TX;
   * once synchronized it exercises the normal SRP LOG route. */
  if (s3_service_is_synced() == 0U) {
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_once("RTOS_PROBE_PRE_SYNC");
#endif
    return HAL_OK;
  }
  result = s3_service_send_log(s_scheduler_probe_payload,
                               (uint8_t)sizeof(s_scheduler_probe_payload));
  if (result != 0) {
    ++s_scheduler_probe_send_failures;
    return UART_TX_FAIL;
  }
  ++s_scheduler_probe_send_count;
  return HAL_OK;
}

static void scheduler_probe_log_runtime(uint32_t first_run)
{
  char line[SMARTCAR_LOG_MAX_PAYLOAD + 1U];

  if (first_run != 0U) {
    (void)snprintf(line, sizeof(line),
                   "RTOS_PROBE first ipsr=%lu sched=%ld basepri=%lu "
                   "heap=%lu tasks=%u%u%u%u%u%u",
                   (unsigned long)__get_IPSR(),
                   (long)xTaskGetSchedulerState(),
                   (unsigned long)__get_BASEPRI(),
                   (unsigned long)xPortGetFreeHeapSize(),
                   (unsigned)scheduler_task_present("scheduler_probe"),
                   (unsigned)scheduler_task_present("logger"),
                   (unsigned)scheduler_task_present("srp_uart"),
                   (unsigned)scheduler_task_present("s3_service"),
                   (unsigned)scheduler_task_present("imu_task"),
                   (unsigned)scheduler_task_present("attitude_gate"));
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_marker("RTOS_PROBE_FIRST");
    cm7_raw_diag_value("PROBE_SYSTICK", g_cm7_systick_count);
    cm7_raw_diag_value("PROBE_PENDSV", g_cm7_pendsv_count);
    cm7_raw_diag_value("PROBE_SVC", g_cm7_svc_count);
#endif
  } else {
    (void)snprintf(line, sizeof(line),
                   "RTOS_PROBE alive=%lu fail=%lu heap=%lu",
                   (unsigned long)s_scheduler_probe_send_count,
                   (unsigned long)s_scheduler_probe_send_failures,
                   (unsigned long)xPortGetFreeHeapSize());
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_value("PROBE_SYSTICK", g_cm7_systick_count);
    cm7_raw_diag_value("PROBE_PENDSV", g_cm7_pendsv_count);
#endif
  }
  LOG_INFO(line);
}

static void scheduler_probe_task(void *argument)
{
  uint32_t first_run = 1U;
  uint32_t last_log_ms = HAL_GetTick();

  (void)argument;
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_task_enter("scheduler_probe");
#endif
  for (;;) {
    (void)scheduler_probe_send_once();
    if (first_run != 0U) {
      scheduler_probe_log_runtime(1U);
      first_run = 0U;
      last_log_ms = HAL_GetTick();
    } else if ((uint32_t)(HAL_GetTick() - last_log_ms) >=
               SMARTCAR_SCHEDULER_PROBE_LOG_PERIOD_MS) {
      last_log_ms = HAL_GetTick();
      scheduler_probe_log_runtime(0U);
    }
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_once("SCHEDULER_PROBE_BEFORE_DELAY");
#endif
    vTaskDelay(pdMS_TO_TICKS(SMARTCAR_SCHEDULER_PROBE_PERIOD_MS));
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_once("SCHEDULER_PROBE_AFTER_DELAY");
#endif
  }
}

