2195573507-web/Smart_Car/STM32H757/CM7/Core/Src/main.c
static void scheduler_probe_start(void)
{
  BaseType_t status;

  s_scheduler_probe_task = NULL;
  s_scheduler_probe_send_count = 0U;
  s_scheduler_probe_send_failures = 0U;
  status = xTaskCreate(scheduler_probe_task, "scheduler_probe",
                       SMARTCAR_SCHEDULER_PROBE_STACK_WORDS, NULL,
                       configMAX_PRIORITIES - 1U, &s_scheduler_probe_task);
  if (status != pdPASS) {
    s_scheduler_probe_task = NULL;
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_marker("RTOS_PROBE_CREATE_FAIL");
    cm7_raw_diag_value("PROBE_CREATE_HEAP",
                       (uint32_t)xPortGetFreeHeapSize());
#endif
    LOG_ERROR("RTOS_PROBE task create failed");
    boot_log("RTOS_PROBE", "CREATE_FAIL");
  } else {
#if SMARTCAR_RAW_DIAGNOSTICS
    cm7_raw_diag_marker("RTOS_PROBE_CREATE_OK");
    cm7_raw_diag_value("PROBE_CREATE_HEAP",
                       (uint32_t)xPortGetFreeHeapSize());
#endif
    LOG_INFO("RTOS_PROBE task create OK priority=max-1");
    boot_log("RTOS_PROBE", "CREATE_OK");
  }
}
#endif

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  boot_log_start();
  log_service_init();
  boot_log("SYSTEM", "START");

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();
  boot_log("CLOCK", "OK");
  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  boot_log("GPIO", "OK");
  /* USART1 owns PA9/PA10 for the CH340 debug adapter. */
  MX_USART1_UART_Init();
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_marker("USART1_READY");
#endif
  /* USART2 is owned by uart_link.c rather than a CubeMX global huart2. */
  uart_link_init();
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_marker(uart_link_is_ready() != 0U
                          ? "UART2_RX_ARM_OK"
                          : "UART2_RX_ARM_FAIL");
  cm7_raw_diag_value("UART2_RX_ARM_PRIMASK", __get_PRIMASK());
  cm7_raw_diag_value("UART2_RX_ARM_BASEPRI", __get_BASEPRI());
#endif
#if !SMARTCAR_MOTOR_BOARD_ONLY
  MX_I2C4_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
#else
  boot_log("MODE", "MOTOR BOARD ONLY");
#endif
  /* USART6 is initialized after all timer/PWM setup so no later peripheral
   * initialization can rewrite PC6/PC7. */
  MX_USART6_UART_Init();
  MB_Transport_Init();
  MB_Protocol_Init();
  /* Establish the physical zero-PWM gate before any RTOS task can accept a
   * command. The coordinator repeats this request until attitude is ready. */
  if (!motor_board_force_stop()) {
    LOG_ERROR("[ATTITUDE_STARTUP] initial motor forced stop queue drop");
  }
  boot_log("MOTOR", "LOCKED");
  /* USER CODE BEGIN 2 */

  if (bsp_uart_init(BSP_UART_USART1, 115200U) == BSP_STATUS_OK) {
    boot_log_uart_ready();
    boot_log("UART", "OK");
  }

  log_service_start();
  report_retained_fault();
  report_retained_rtos_health();

#if !SMARTCAR_MOTOR_BOARD_ONLY
  imu_runtime_start();
#endif
  boot_log("RTOS", "READY");
  boot_log("SYSTEM", "READY");
  uart_link_task_start();
  s3_service_start();
#if !SMARTCAR_MOTOR_BOARD_ONLY
  chassis_task_start();
#endif
#if SMARTCAR_MOTOR_BOARD_ONLY
  motor_board_task_start();
#else
  attitude_startup_coordinator_start();
#endif
  scheduler_log_task_admission();
#if SMARTCAR_SCHEDULER_PROBE
  scheduler_probe_start();
#endif
  boot_log("RTOS", "SCHEDULER_START");
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_marker("SCHEDULER_START");
#endif
  vTaskStartScheduler();
  /* Reaching here means the portable scheduler returned instead of entering
   * the first task. Keep the marker for a retained/early-log diagnosis. */
#if SMARTCAR_RAW_DIAGNOSTICS
  cm7_raw_diag_marker("[ERROR] Scheduler returned! Heap exhausted?");
  cm7_raw_diag_value("SCHEDULER_RETURNED_HEAP", (uint32_t)xPortGetFreeHeapSize());
  for (;;) {
    __asm volatile("wfi");
  }
#endif
  boot_log("RTOS", "SCHEDULER_RETURNED");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 60;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

